# TabbedDialogExtension Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
TabbedDialogExtension Constructor
TabbedDialogExtension Class See Also
---
Constructs a extension instance with a control and ok action handler.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public TabbedDialogExtension(
	UserControl userControl,
	TabbedDialogAction onOK
)
```

Visual Basic
---
```text
Public Sub New ( _
	userControl As UserControl, _
	onOK As TabbedDialogAction _
)
```

Visual C++
---
```text
public:
TabbedDialogExtension(
	UserControl^ userControl,
	TabbedDialogAction^ onOK
)
```

# ### Parameters
userControl
    Type: System.Windows.Controls..::..UserControlThe control.
onOK
    Type: Autodesk.Revit.UI..::..TabbedDialogActionThe ok action handler.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when userControl or onOK is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when userControl is already bound to another tabbed dialog. |

# See Also
TabbedDialogExtension Class
Autodesk.Revit.UI Namespace